/**
提前还部分本金（未缩短还款年限）
年利率：五年期 LPR（4.65%）+ 0.7% bp = 5.35%
23年1月降息后：五年期 LPR（4.3%）+ 0.7% bp = 5%
24年1月降息后：五年期 LPR（4.2%）+ 0.7% bp = 4.9%
*/

const 总贷款额 = 215 * 10000;
const 总贷款月数 = 30 * 12;
const 还款日 = 1;

const 还款阶段 = new Map();
还款阶段.set('2021-02', { // 首次还款
  年利率: 5.35,
});
还款阶段.set('2021-07-20', {
  提前还款: 10 * 10000,
  重置本金: 2369.53,
});
还款阶段.set('2023-02', { // 第一次 LPR 利率调整
  年利率: 5,
});
还款阶段.set('2024-02', { // 第二次 LPR 利率调整
  年利率: 4.9,
});

const { 累计利息, table } = calculate(总贷款额, 总贷款月数, [...还款阶段.entries()]);
const { 累计利息: 未提前还款的总利息 } = calculate(
  总贷款额,
  总贷款月数,
  [...还款阶段.entries()].filter(p => !p[1].提前还款),
  { silence: true },
);
console.table(table);
console.warn('提前还款后节省的总利息:', formatCurrency(未提前还款的总利息 - 累计利息));
