/**
年利率：五年期 LPR（4.65%）+ 0.95% bp = 5.6%，每年 9 月 7 号重定价
22年9月降息后：五年期 LPR（4.3%）+ 0.95% bp = 5.25%
23年9月降息后：五年期 LPR（4.2%）+ 0.95% bp = 5.15%
24年9月降息后：五年期 LPR（3.85%）+ 0.95% bp = 4.8%
*/

const 总贷款额 = 47.5 * 10000;
const 总贷款月数 = 10 * 12;
const 还款日 = 10;

const 还款阶段 = new Map();
还款阶段.set('2021-10', { // 首次还款
  年利率: 5.6,
  重置月息: 2438.33,
});
还款阶段.set('2022-09', { // 第一次 LPR 利率调整
  年利率: 5.25,
  重置月息: 2052.44,
});
还款阶段.set('2023-09', { // 第二次 LPR 利率调整
  年利率: 5.15,
  重置月息: 1759.44,
});
还款阶段.set('2024-09', { // 第三次 LPR 利率调整
  年利率: 4.8,
  重置月息: 1544.13,
});

const { table } = calculate(总贷款额, 总贷款月数, [...还款阶段.entries()]);
console.table(table);
