/**
年利率：五年期 LPR（4.2%）- 0.2% bp = 4%，每年 10 月 10 号重定价
*/

const 总贷款额 = 327 * 10000;
const 总贷款月数 = 30 * 12;
const 还款日 = 10;

const 还款阶段 = new Map();
还款阶段.set('2023-11', { // 首次还款
  年利率: 4,
});

// Step 1，先断个点查一下到时候还剩多少本金待还
还款阶段.set('2024-12', {
  断点: true,
});
calculate(总贷款额, 总贷款月数, [...还款阶段.entries()]);
// 截止 2024-12 已累计还款 14 个月: {累计月供: '¥218,560.72', 累计本金: '¥67,409.09', 累计利息: '¥151,151.63'} 剩余待还本金: ¥3,202,590.91

// Step 2，将上一步查到的数据填入，打印全量还款明细
还款阶段.set('2024-12', {
  提前还款: 320 * 10000,
  总贷款月数缩短: 总贷款月数 - 14,
});
const { table } = calculate(总贷款额, 总贷款月数, [...还款阶段.entries()]);
console.table(table);
